---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltLocation
source: html/842451c7-d30f-03ff-a6ac-f2c935c0f16f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltLocation Property

"Location"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemBoltLocation { get; }
```